carloscn/s32k344_rtd/BaseNXP_TS_T40D34M30I0R0/header/S32M27x_SIUL2.h
#define SIUL2_UDR2_UDR13_MASK                    (0x2000U)
#define SIUL2_UDR2_UDR13_SHIFT                   (13U)
#define SIUL2_UDR2_UDR13_WIDTH                   (1U)
#define SIUL2_UDR2_UDR13(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR13_SHIFT)) & SIUL2_UDR2_UDR13_MASK)

#define SIUL2_UDR2_UDR14_MASK                    (0x4000U)
#define SIUL2_UDR2_UDR14_SHIFT                   (14U)
#define SIUL2_UDR2_UDR14_WIDTH                   (1U)
#define SIUL2_UDR2_UDR14(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR14_SHIFT)) & SIUL2_UDR2_UDR14_MASK)

#define SIUL2_UDR2_UDR15_MASK                    (0x8000U)
#define SIUL2_UDR2_UDR15_SHIFT                   (15U)
#define SIUL2_UDR2_UDR15_WIDTH                   (1U)
#define SIUL2_UDR2_UDR15(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR15_SHIFT)) & SIUL2_UDR2_UDR15_MASK)

#define SIUL2_UDR2_UDR16_MASK                    (0x10000U)
#define SIUL2_UDR2_UDR16_SHIFT                   (16U)
#define SIUL2_UDR2_UDR16_WIDTH                   (1U)
#define SIUL2_UDR2_UDR16(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR16_SHIFT)) & SIUL2_UDR2_UDR16_MASK)

#define SIUL2_UDR2_UDR17_MASK                    (0x20000U)
#define SIUL2_UDR2_UDR17_SHIFT                   (17U)
#define SIUL2_UDR2_UDR17_WIDTH                   (1U)
#define SIUL2_UDR2_UDR17(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR17_SHIFT)) & SIUL2_UDR2_UDR17_MASK)

#define SIUL2_UDR2_UDR18_MASK                    (0x40000U)
#define SIUL2_UDR2_UDR18_SHIFT                   (18U)
#define SIUL2_UDR2_UDR18_WIDTH                   (1U)
#define SIUL2_UDR2_UDR18(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR18_SHIFT)) & SIUL2_UDR2_UDR18_MASK)

#define SIUL2_UDR2_UDR19_MASK                    (0x80000U)
#define SIUL2_UDR2_UDR19_SHIFT                   (19U)
#define SIUL2_UDR2_UDR19_WIDTH                   (1U)
#define SIUL2_UDR2_UDR19(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR19_SHIFT)) & SIUL2_UDR2_UDR19_MASK)

#define SIUL2_UDR2_UDR20_MASK                    (0x100000U)
#define SIUL2_UDR2_UDR20_SHIFT                   (20U)
#define SIUL2_UDR2_UDR20_WIDTH                   (1U)
#define SIUL2_UDR2_UDR20(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR20_SHIFT)) & SIUL2_UDR2_UDR20_MASK)

#define SIUL2_UDR2_UDR21_MASK                    (0x200000U)
#define SIUL2_UDR2_UDR21_SHIFT                   (21U)
#define SIUL2_UDR2_UDR21_WIDTH                   (1U)
#define SIUL2_UDR2_UDR21(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR21_SHIFT)) & SIUL2_UDR2_UDR21_MASK)

#define SIUL2_UDR2_UDR22_MASK                    (0x400000U)
#define SIUL2_UDR2_UDR22_SHIFT                   (22U)
#define SIUL2_UDR2_UDR22_WIDTH                   (1U)
#define SIUL2_UDR2_UDR22(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR22_SHIFT)) & SIUL2_UDR2_UDR22_MASK)

#define SIUL2_UDR2_UDR23_MASK                    (0x800000U)
#define SIUL2_UDR2_UDR23_SHIFT                   (23U)
#define SIUL2_UDR2_UDR23_WIDTH                   (1U)
#define SIUL2_UDR2_UDR23(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR23_SHIFT)) & SIUL2_UDR2_UDR23_MASK)

#define SIUL2_UDR2_UDR24_MASK                    (0x1000000U)
#define SIUL2_UDR2_UDR24_SHIFT                   (24U)
#define SIUL2_UDR2_UDR24_WIDTH                   (1U)
#define SIUL2_UDR2_UDR24(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR24_SHIFT)) & SIUL2_UDR2_UDR24_MASK)

#define SIUL2_UDR2_UDR25_MASK                    (0x2000000U)
#define SIUL2_UDR2_UDR25_SHIFT                   (25U)
#define SIUL2_UDR2_UDR25_WIDTH                   (1U)
#define SIUL2_UDR2_UDR25(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR25_SHIFT)) & SIUL2_UDR2_UDR25_MASK)

#define SIUL2_UDR2_UDR26_MASK                    (0x4000000U)
#define SIUL2_UDR2_UDR26_SHIFT                   (26U)
#define SIUL2_UDR2_UDR26_WIDTH                   (1U)
#define SIUL2_UDR2_UDR26(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR26_SHIFT)) & SIUL2_UDR2_UDR26_MASK)

#define SIUL2_UDR2_UDR27_MASK                    (0x8000000U)
#define SIUL2_UDR2_UDR27_SHIFT                   (27U)
#define SIUL2_UDR2_UDR27_WIDTH                   (1U)
#define SIUL2_UDR2_UDR27(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR27_SHIFT)) & SIUL2_UDR2_UDR27_MASK)

#define SIUL2_UDR2_UDR28_MASK                    (0x10000000U)
#define SIUL2_UDR2_UDR28_SHIFT                   (28U)
#define SIUL2_UDR2_UDR28_WIDTH                   (1U)
#define SIUL2_UDR2_UDR28(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR28_SHIFT)) & SIUL2_UDR2_UDR28_MASK)

#define SIUL2_UDR2_UDR29_MASK                    (0x20000000U)
#define SIUL2_UDR2_UDR29_SHIFT                   (29U)
#define SIUL2_UDR2_UDR29_WIDTH                   (1U)
#define SIUL2_UDR2_UDR29(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR29_SHIFT)) & SIUL2_UDR2_UDR29_MASK)

#define SIUL2_UDR2_UDR30_MASK                    (0x40000000U)
#define SIUL2_UDR2_UDR30_SHIFT                   (30U)
#define SIUL2_UDR2_UDR30_WIDTH                   (1U)
#define SIUL2_UDR2_UDR30(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR30_SHIFT)) & SIUL2_UDR2_UDR30_MASK)

#define SIUL2_UDR2_UDR31_MASK                    (0x80000000U)
#define SIUL2_UDR2_UDR31_SHIFT                   (31U)
#define SIUL2_UDR2_UDR31_WIDTH                   (1U)
#define SIUL2_UDR2_UDR31(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR2_UDR31_SHIFT)) & SIUL2_UDR2_UDR31_MASK)
/*! @} */

/*! @name MIDR3 - SIUL2 MCU ID Register #3 */
/*! @{ */

#define SIUL2_MIDR3_SYS_RAM_SIZE_MASK            (0x3FU)
#define SIUL2_MIDR3_SYS_RAM_SIZE_SHIFT           (0U)
#define SIUL2_MIDR3_SYS_RAM_SIZE_WIDTH           (6U)
#define SIUL2_MIDR3_SYS_RAM_SIZE(x)              (((uint32_t)(((uint32_t)(x)) << SIUL2_MIDR3_SYS_RAM_SIZE_SHIFT)) & SIUL2_MIDR3_SYS_RAM_SIZE_MASK)

#define SIUL2_MIDR3_PART_NO_SUF_MASK             (0xFC00U)
#define SIUL2_MIDR3_PART_NO_SUF_SHIFT            (10U)
#define SIUL2_MIDR3_PART_NO_SUF_WIDTH            (6U)
#define SIUL2_MIDR3_PART_NO_SUF(x)               (((uint32_t)(((uint32_t)(x)) << SIUL2_MIDR3_PART_NO_SUF_SHIFT)) & SIUL2_MIDR3_PART_NO_SUF_MASK)

#define SIUL2_MIDR3_PROD_FAM_NO_MASK             (0x3FF0000U)
#define SIUL2_MIDR3_PROD_FAM_NO_SHIFT            (16U)
#define SIUL2_MIDR3_PROD_FAM_NO_WIDTH            (10U)
#define SIUL2_MIDR3_PROD_FAM_NO(x)               (((uint32_t)(((uint32_t)(x)) << SIUL2_MIDR3_PROD_FAM_NO_SHIFT)) & SIUL2_MIDR3_PROD_FAM_NO_MASK)

#define SIUL2_MIDR3_PROD_FAM_LET_MASK            (0xFC000000U)
#define SIUL2_MIDR3_PROD_FAM_LET_SHIFT           (26U)
#define SIUL2_MIDR3_PROD_FAM_LET_WIDTH           (6U)
#define SIUL2_MIDR3_PROD_FAM_LET(x)              (((uint32_t)(((uint32_t)(x)) << SIUL2_MIDR3_PROD_FAM_LET_SHIFT)) & SIUL2_MIDR3_PROD_FAM_LET_MASK)
/*! @} */

